--- a/docs/configuration/combiner.md
+++ b/docs/configuration/combiner.md
@@ -176,19 +186,19 @@ Parameters:
 
 ### Transformer Combiner
 
-```
-+-----------+
-|Input      |
-|Feature 1  +-+
-+-----------+ |
-+-----------+ |  +------------+   +------+   +----------+
-|...        +--->|Transformer +-->|Reduce+-->|Fully     +->
-|           | |  |Stack       |   +------+   |Connected |
-+-----------+ |  +------------+              |Layers    |
-+-----------+ |                              +----------+
-|Input      +-+
-|Feature N  |
-+-----------+
+``` mermaid
+graph LR
+  I1[Encoder Output 1] --> C["Transformer Stack"];
+  IK[...] --> C;
+  IN[Encoder Output N] --> C;
+  C --> R[Reduce];
+  R --> FC[Fully Connected Layers];
+  FC --> ...;
+  subgraph COMBINER
+  C
+  R
+  FC
+  end
 ```
 
 The `transformer` combiner combines input features using a stack of Transformer blocks (from [Attention Is All You Need](https://arxiv.org/abs/1706.03762)).
